{
  "audio": [

  ],
  "category": "content/categories/list/technology.json",
  "datePublished": "2021-08-27",
  "keywords": [
    "content",
    "publishing",
    "web"
  ],
  "license": "content/licenses/list/cc-attribution.json",
  "video": [

  ],
  "sidebar": [

  ],
  "title": "A Content Publisher's Guide to the World Wide Web",
  "abstract": "",
  "author": "content/people/list/benfortuna.json",
  "headline": "",
  "image": "",
  "published": false,
  "text": "<p>If you own a domain, publish a blog, or run a business on the Internet, chances are you are a Content Publisher. A publisher is simply anyone that makes original content available on the Internet. As such publishers are many and diverse, with a wide variety of requirements and content produced. This has also lead to wide variety in solutions and tools used to create and publish this content.</p><p><strong>Content Management</strong></p><p>When a Web developer thinks about publishing on the World Wide Web we tend to immediately consider the technologies that enable publishing on the Web. Ultimately it is the HTML, CSS and JavaScript that enable the billions of site on the Internet to do what they do.</p><p>So when you engage a Web developer to build a website you are likely to get a site that initially meets requirements, but can be difficult to maintain for anyone except the Web developer. A popular solution to this problem is to use a Content Management System (CMS), which separates the maintenance of the content from the presentation, facilitating easier content updates without requiring Web development skills.</p><p>There are many different Content Management Systems, with a wide-range of target audiences, however the most popular consumer solutions include Wordpress, Wix.com, Blogger, Drupal, Ghost, and the list goes on. Whilst these solutions can be a great introduction to publishing on the Web, there are some common limitations, including limited customization and data portability constraints.</p><p><strong>Application vs Publication</strong></p><p>Since its inception, the World Wide Web has evolved to a point where we might simplistically categorize websites as either a Web application or a Web publication. Web applications can be thought of as sites whose content is created by the users (also known as <em>Web 2.0</em>). Social networking sites are a good example of Web applications, in that they only publish content created by the users (in fact Facebook argues that they are simply a publishing platform, and are thus absolved of responsibility for the user content. However it could be argued that through curation and promotion of selected user content they are in fact culpable).</p><p>Web publications on the other hand, are sites that produce and publish original content on their sites. News sites such as BBC.com and CNN.com are examples of Web publications. Content Management Systems are typically associated with Web publications, and are usually not suited to Web application development.</p><p></p>",
  "related": [

  ],
  "name": "",
  "description": "",
  "url": "",
  "advanced_configuration": false,
  "sling_resourceType": "wp/page/article",
  "sling:resourceType": "wp/page/article"
}
